In [5]:
import pandas as pd

In [11]:
df = pd.DataFrame([[1, 2], [3, 4], [5, 6]], columns=['x', 'y',], index=['a', 'b', 'c'])

In [4]:
df

   a  b
0  1  3
1  2  4

In [9]:
df.head()

   x  y
0  1  2
1  3  4
2  5  6

In [10]:
df.tail()

   x  y
0  1  2
1  3  4
2  5  6

In [12]:
df

   x  y
a  1  2
b  3  4
c  5  6

In [13]:
df.head(1)

   x  y
a  1  2

In [14]:
df.tail(1)

   x  y
c  5  6

In [16]:
coffee = pd.read_csv('warmup-data/coffee.csv')

In [17]:
coffee.head()

         Day Coffee Type  Units Sold
0     Monday    Espresso          25
1     Monday       Latte          15
2    Tuesday    Espresso          30
3    Tuesday       Latte          20
4  Wednesday    Espresso          35

In [21]:
results = pd.read_parquet('data/results.parquet')

In [22]:
results.head()

,year,type,discipline,event,as,athlete_id,noc,team,place,tied,medal
0,1912.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,17.0,True,None
1,1912.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jean Montariol,NaN,False,None
2,1920.0,Summer,Tennis,"Singles, Men (Olympic)",Jean-François Blanchy,1,FRA,None,32.0,True,None
3,1920.0,Summer,Tennis,"Doubles, Mixed (Olympic)",Jean-François Blanchy,1,FRA,Jeanne Vaussard,8.0,True,None
4,1920.0,Summer,Tennis,"Doubles, Men (Olympic)",Jean-François Blanchy,1,FRA,Jacques Brugnon,4.0,False,None

In [28]:
coffee.sort_values('Units Sold', ascending=False)

          Day Coffee Type  Units Sold
10   Saturday    Espresso          45
8      Friday    Espresso          45
12     Sunday    Espresso          45
6    Thursday    Espresso          40
4   Wednesday    Espresso          35
11   Saturday       Latte          35
13     Sunday       Latte          35
9      Friday       Latte          35
2     Tuesday    Espresso          30
7    Thursday       Latte          30
0      Monday    Espresso          25
5   Wednesday       Latte          25
3     Tuesday       Latte          20
1      Monday       Latte          15

In [29]:
bios = pd.read_csv('data/bios.csv')

In [30]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [31]:
bios

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25
...,...,...,...,...,...,...,...,...,...,...
145495,149222,Polina Luchnikova,2002-01-30,Serov,Sverdlovsk,RUS,ROC,167.0,61.0,NaN
145496,149223,Valeriya Merkusheva,1999-09-20,Moskva (Moscow),Moskva,RUS,ROC,168.0,65.0,NaN
145497,149224,Yuliya Smirnova,1998-05-08,Kotlas,Arkhangelsk,RUS,ROC,163.0,55.0,NaN
145498,149225,André Foussard,1899-05-19,Niort,Deux-Sèvres,FRA,France,166.0,NaN,1986-03-18
145499,149814,Bill Phillips,1913-07-15,Dulwich Hill,New South Wales,AUS,Australia,NaN,NaN,2003-10-20

In [43]:
bios.loc[bios['born_country'] == 'PAK', ['name', 'born_city']]

                         name   born_city
288            Mohammed Sleem      Multan
1046              Farjad Saif     Karachi
3991               Boy Murphy      Murree
4800              Javid Aslam  Faisalabad
4880                 Asif Dar      Quetta
...                       ...         ...
128770          Najma Parveen  Faisalabad
128771          Minhal Sohail     Karachi
132543            Mehboob Ali       Kasur
132545  Ghulam Mustafa Bashir       Okara
142245            Talha Talib  Gujranwala

[187 rows x 2 columns]

In [44]:
bios.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,NaN,NaN,1960-10-02
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.0,76.0,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.0,76.0,1994-07-17
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.0,64.0,1978-03-20
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,NaN,NaN,1930-07-25

In [53]:
bios.loc[bios['name'].str.contains('saqlain|zain' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
5275,5294,Zaina Kapepula,1975-08-14,Lubumbashi,Haut-Katanga,COD,Democratic Republic of the Congo,180.0,73.0,NaN
12794,12864,Jean-Yves Touzaint,1948-10-08,NaN,NaN,NaN,France,168.0,63.0,NaN
12795,12865,Thierry Touzaint,1953-12-26,Granville,Manche,FRA,France,174.0,72.0,NaN
16297,16412,Safarrudin Zain,1938-03-22,George Town,Pulau Pinang,MAS,Malaysia,166.0,66.0,2023-06-20
19419,19558,Khair-ud-Din bin Zainal,1946-11-21,NaN,NaN,NaN,Malaysia,169.0,64.0,NaN
19459,19598,Azaari Mohamed Zain,1952-12-11,NaN,NaN,NaN,Malaysia,173.0,64.0,NaN
19467,19606,Nor Saiful Zaini Nasir-ud-Din,1966-03-27,NaN,NaN,NaN,Malaysia,170.0,74.0,NaN
29765,29990,Georges Mauvezain,1878-02-27,Paris Xe,Paris,FRA,France,159.0,NaN,1943-09-19
50577,50936,Ana Carolina Itzaina,1979-05-14,NaN,NaN,NaN,Uruguay,NaN,NaN,NaN
72835,73389,Zain-ud-Din bin Abdul Wahab,1948-05-14,Labuan,Labuan,MAS,Malaysia,170.0,59.0,2022-06-07
89968,90688,Nicolas Touzaint,1980-05-10,Angers,Maine-et-Loire,FRA,France,174.0,60.0,NaN
112653,113931,Muhammad Saqlain,1978-02-23,Lahore,Punjab,PAK,Pakistan,178.0,64.0,NaN
118383,120093,Zain Shaito,1990-10-19,Dallas,Texas,USA,Lebanon,185.0,72.0,NaN
121398,123383,Salma Zain,1990-04-14,Al-Iskanderiya (Alexandria),Al-Iskanderiya,EGY,Egypt,170.0,60.0,NaN

In [61]:
bios.loc[bios['name'].str.contains('saqlain', case=False), 'NOC'] = 'ITA'

In [62]:
bios.loc[bios['name'].str.contains('saqlain' , case=False)]

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date
112653,113931,Muhammad Saqlain,1978-02-23,Lahore,Punjab,PAK,ITA,178.0,64.0,NaN

In [1]:
bios.loc[bios['name'].str.contains('zain' , case=False)]

NameError: name 'bios' is not defined